examples/dot/time_rabi.dot
strict digraph "" {
    node [label="\N"];
    "NumericExpression1" [label="101", shape=box];
    "Port1" [label="Port", shape=box];
    "Port1" -> "NumericExpression1"  [label="Id", style=dashed];
    "NumericExpression2" [label="0.3", shape=box];
    "Amplitude1" [label="Amplitude", shape=box];
    "Amplitude1" -> "NumericExpression2"  [label="Value", style=dashed];
    "Instruction3" [label="DcBias", shape=box];
    "Instruction3" -> "Port1"  [label="Port", style=dashed];
    "Instruction3" -> "Amplitude1"  [label="Amplitude", style=dashed];
    "NumericExpression3" [label="0", shape=box];
    "NumericExpression4" [label="1E-08", shape=box];
    "NumericExpression5" [label="1E-06", shape=box];
    "NumericRange1" [label="SteppedRange", shape=box];
    "NumericRange1" -> "NumericExpression3"  [label="InclusiveStart", style=dashed];
    "NumericRange1" -> "NumericExpression4"  [label="Step", style=dashed];
    "NumericRange1" -> "NumericExpression5"  [label="ExclusiveEnd", style=dashed];
    "NumericParameter1" [label="NumericParameter", shape=box];
    "NumericExpression6" [label="0", shape=box];
    "NumericExpression7" [label="1", shape=box];
    "NumericExpression8" [label="1000", shape=box];
    "NumericRange2" [label="SteppedRange", shape=box];
    "NumericRange2" -> "NumericExpression6"  [label="InclusiveStart", style=dashed];
    "NumericRange2" -> "NumericExpression7"  [label="Step", style=dashed];
    "NumericRange2" -> "NumericExpression8"  [label="ExclusiveEnd", style=dashed];
    "NumericParameter2" [label="NumericParameter", shape=box];
    "Interval2" [label="1 ms", shape=box];
    "Instruction7" [label="Delay", shape=box];
    "Instruction7" -> "Interval2"  [label="Duration", style=dashed];
    "NumericExpression9" [label="100", shape=box];
    "Port2" [label="Port", shape=box];
    "Port2" -> "NumericExpression9"  [label="Id", style=dashed];
    "Frequency3" [label="5 GHz", shape=box];
    "Radians4" [label="0 rad", shape=box];
    "Frequency5" [label="10 MHz", shape=box];
    "Frame1" [label="Frame", shape=box];
    "Frame1" -> "Port2"  [label="Port", style=dashed];
    "Frame1" -> "Frequency3"  [label="Frequency", style=dashed];
    "Frame1" -> "Radians4"  [label="Phase", style=dashed];
    "Frame1" -> "Frequency5"  [label="IntermediateFrequency", style=dashed];
    "Seconds6" [label="Seconds", shape=box];
    "Seconds6" -> "NumericParameter1"  [label="Value", style=dashed];
    "Waveform1" [label="ConstantWaveform", shape=box];
    "Waveform1" -> "Seconds6"  [label="Duration", style=dashed];
    "Instruction9" [label="ModulatedPulse", shape=box];
    "Instruction9" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction9" -> "Waveform1"  [label="Envelope", style=dashed];
    "NumericExpression10" [label="0.1", shape=box];
    "Amplitude7" [label="Amplitude", shape=box];
    "Amplitude7" -> "NumericExpression10"  [label="Value", style=dashed];
    "Instruction9" -> "Amplitude7"  [label="Amplitude", style=dashed];
    "NumericExpression11" [label="200", shape=box];
    "Port3" [label="Port", shape=box];
    "Port3" -> "NumericExpression11"  [label="Id", style=dashed];
    "Frequency8" [label="7 GHz", shape=box];
    "Radians9" [label="0 rad", shape=box];
    "Frequency10" [label="20 MHz", shape=box];
    "Frame2" [label="Frame", shape=box];
    "Frame2" -> "Port3"  [label="Port", style=dashed];
    "Frame2" -> "Frequency8"  [label="Frequency", style=dashed];
    "Frame2" -> "Radians9"  [label="Phase", style=dashed];
    "Frame2" -> "Frequency10"  [label="IntermediateFrequency", style=dashed];
    "Interval11" [label="1 μs", shape=box];
    "Waveform2" [label="ConstantWaveform", shape=box];
    "Waveform2" -> "Interval11"  [label="Duration", style=dashed];
    "Instruction12" [label="ModulatedPulse", shape=box];
    "Instruction12" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction12" -> "Waveform2"  [label="Envelope", style=dashed];
    "NumericExpression12" [label="0.2", shape=box];
    "Amplitude12" [label="Amplitude", shape=box];
    "Amplitude12" -> "NumericExpression12"  [label="Value", style=dashed];
    "Instruction12" -> "Amplitude12"  [label="Amplitude", style=dashed];
    "NumericExpression13" [label="300", shape=box];
    "Port4" [label="Port", shape=box];
    "Port4" -> "NumericExpression13"  [label="Id", style=dashed];
    "Interval13" [label="1 μs", shape=box];
    "ComplexRangeExpression1" [label="AcquisitionComplexRangeResult", shape=box];
    "Instruction13" [label="AdcAcquisition", shape=box];
    "Instruction13" -> "Port4"  [label="Port", style=dashed];
    "Instruction13" -> "Interval13"  [label="Duration", style=dashed];
    "Instruction13" -> "ComplexRangeExpression1"  [label="Result", style=dashed];
    "Instruction14:Alignment" [label="StartToStart", shape=box];
    "Instruction14:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction14:Relationship" -> "Instruction14:Alignment"  [label="Alignment", style=dashed];
    "Instruction14" [label="Dependency", shape=box];
    "Instruction14" -> "Instruction14:Relationship"  [label="Relationship", style=dashed];
    "Instruction14" -> "Instruction12"  [label="Lhs", style=dashed];
    "Instruction14" -> "Instruction13"  [label="Rhs", style=dashed];
    "ComplexRangeExpression2:Values" [label="(0, 1), (2, 3), (4, 5), ..., (1998, 1999)", shape=box];
    "ComplexRangeExpression2" [label="LiteralComplexRange", shape=box];
    "ComplexRangeExpression2" -> "ComplexRangeExpression2:Values"  [label="Values", style=dashed];
    "ComplexExpression1" [label="ComplexDotProduct", shape=box];
    "ComplexExpression1" -> "ComplexRangeExpression1"  [label="Lhs", style=dashed];
    "ComplexExpression1" -> "ComplexRangeExpression2"  [label="Rhs", style=dashed];
    "ComplexRangeRegister1" [label="ComplexRangeRegister", shape=box];
    "Instruction15" [label="ComplexAppend", shape=box];
    "Instruction15" -> "ComplexExpression1"  [label="Input", style=dashed];
    "Instruction15" -> "ComplexRangeRegister1"  [label="Output", style=dashed];
    "Instruction16:Alignment" [label="EndToStart", shape=box];
    "Instruction16:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction16:Relationship" -> "Instruction16:Alignment"  [label="Alignment", style=dashed];
    "Instruction16" [label="Dependency", shape=box];
    "Instruction16" -> "Instruction16:Relationship"  [label="Relationship", style=dashed];
    "Instruction16" -> "Instruction14"  [label="Lhs", style=dashed];
    "Instruction16" -> "Instruction15"  [label="Rhs", style=dashed];
    "Instruction17:Alignment" [label="EndToStart", shape=box];
    "Instruction17:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction17:Relationship" -> "Instruction17:Alignment"  [label="Alignment", style=dashed];
    "Instruction17" [label="Dependency", shape=box];
    "Instruction17" -> "Instruction17:Relationship"  [label="Relationship", style=dashed];
    "Instruction17" -> "Instruction9"  [label="Lhs", style=dashed];
    "Instruction17" -> "Instruction16"  [label="Rhs", style=dashed];
    "Instruction18:Alignment" [label="EndToStart", shape=box];
    "Instruction18:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction18:Relationship" -> "Instruction18:Alignment"  [label="Alignment", style=dashed];
    "Instruction18" [label="Dependency", shape=box];
    "Instruction18" -> "Instruction18:Relationship"  [label="Relationship", style=dashed];
    "Instruction18" -> "Instruction7"  [label="Lhs", style=dashed];
    "Instruction18" -> "Instruction17"  [label="Rhs", style=dashed];
    "Instruction19:Alignment" [label="EndToStart", shape=box];
    "Instruction19:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction19:Relationship" -> "Instruction19:Alignment"  [label="Alignment", style=dashed];
    "Function20" [label="Function", shape=box];
    "Function20" -> "NumericParameter2"  [label="Parameter", style=dashed];
    "Function20" -> "Instruction18"  [label="Body1", style=dashed];
    "Instruction19" [label="ForEachNumeric", shape=box];
    "Instruction19" -> "NumericRange2"  [label="Source", style=dashed];
    "Instruction19" -> "Instruction19:Relationship"  [label="Relationship", style=dashed];
    "Instruction19" -> "Function20"  [label="Body", style=dashed];
    "Instruction21:Alignment" [label="EndToStart", shape=box];
    "Instruction21:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction21:Relationship" -> "Instruction21:Alignment"  [label="Alignment", style=dashed];
    "Function22" [label="Function", shape=box];
    "Function22" -> "NumericParameter1"  [label="Parameter", style=dashed];
    "Function22" -> "Instruction19"  [label="Body1", style=dashed];
    "Instruction21" [label="ForEachNumeric", shape=box];
    "Instruction21" -> "NumericRange1"  [label="Source", style=dashed];
    "Instruction21" -> "Instruction21:Relationship"  [label="Relationship", style=dashed];
    "Instruction21" -> "Function22"  [label="Body", style=dashed];
    "Instruction23:Alignment" [label="EndToStart", shape=box];
    "Instruction23:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction23:Relationship" -> "Instruction23:Alignment"  [label="Alignment", style=dashed];
    "Instruction23" [label="Dependency", shape=box];
    "Instruction23" -> "Instruction23:Relationship"  [label="Relationship", style=dashed];
    "Instruction23" -> "Instruction3"  [label="Lhs", style=dashed];
    "Instruction23" -> "Instruction21"  [label="Rhs", style=dashed];
    "ComplexRangeExpression3:BufferDimensions" [label="100, 1000", shape=box];
    "ComplexRangeExpression3" [label="ComplexAverageOver", shape=box];
    "ComplexRangeExpression3" -> "ComplexRangeRegister1"  [label="Source", style=dashed];
    "ComplexRangeExpression3" -> "ComplexRangeExpression3:BufferDimensions"  [label="BufferDimensions", style=dashed];
    "ComplexRangeExpression3" -> "1"  [label="AveragingAxis", style=dashed];
    "ComplexRangeRegister2" [label="ComplexRangeRegister", shape=box];
    "Instruction24" [label="ComplexAssign", shape=box];
    "Instruction24" -> "ComplexRangeExpression3"  [label="Input", style=dashed];
    "Instruction24" -> "ComplexRangeRegister2"  [label="Output", style=dashed];
    "Instruction25:Alignment" [label="EndToStart", shape=box];
    "Instruction25:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction25:Relationship" -> "Instruction25:Alignment"  [label="Alignment", style=dashed];
    "Instruction25" [label="Dependency", shape=box];
    "Instruction25" -> "Instruction25:Relationship"  [label="Relationship", style=dashed];
    "Instruction25" -> "Instruction23"  [label="Lhs", style=dashed];
    "Instruction25" -> "Instruction24"  [label="Rhs", style=dashed];
    "Job:ComplexRangeOutputs" [label="ComplexRangeOutputs", shape=box];
    "Job:ComplexRangeOutputs" -> "ComplexRangeRegister2"  [label="0", style=dashed];
    "Job" [label="Job", shape=box];
    "Job" -> "Instruction25"  [label="EntryPoint1", style=dashed];
    "Job" -> "Job:ComplexRangeOutputs"  [label="ComplexRangeOutputs", style=dashed];
}
